{
  pkgs
, tsssni
, ...
}:
{
  programs.nixvim = {
    plugins.dashboard = {
      enable = true;
      settings.config = {
        header = [          
          "  _________   ______       ______       ______       ___   __       ________     " 
          " /________/\\ /_____/\\     /_____/\\     /_____/\\     /__/\\ /__/\\    /_______/\\    "
          " \\__.::.__\\/ \\::::_\\/_    \\::::_\\/_    \\::::_\\/_    \\::\\_\\\\  \\ \\   \\__.::._\\/    " 
          "    \\::\\ \\    \\:\\/___/\\    \\:\\/___/\\    \\:\\/___/\\    \\:. `-\\  \\ \\     \\::\\ \\     "
          "     \\::\\ \\    \\_::._\\:\\    \\_::._\\:\\    \\_::._\\:\\    \\:. _    \\ \\    _\\::\\ \\__  " 
          "      \\::\\ \\     /____\\:\\     /____\\:\\     /____\\:\\    \\. \\`-\\  \\ \\  /__\\::\\__/\\ "
          "       \\__\\/     \\_____\\/     \\_____\\/     \\_____\\/     \\__\\/ \\__\\/  \\________\\/ " 
          "                                                                                 "
        ];
        packages.enable = false;
        shortcut = [
          {
            desc = "[  tsssni ]";
            group = "DashboardShortCut";
          }
        ];
        footer = [
          "                                                "
          "何気ない日常で、ほんの少しの奇跡を見つける物語。"
          "                                                "
        ];
      };
    };
    extraPlugins = []
      ++ (with pkgs.vimPlugins; [ lush-nvim ]) 
      ++ (with tsssni.pkgs.vimPlugins; [ cyyber-nvim ]);
    colorscheme = "tsssni-theme";
  };
}
